credits = {
    "Obfuscator": {
        "Created_By": {
            "User319183": "Free | Open Source Version"
        },
        "Features": {
            "Random_String_Generation": "true",
            "AES_and_RSA_Encryption": "true",
            "String_Encryption": "true",
            "String_Decryption": "true",
            "Code_Obfuscation": "true",
            "Name_Obfuscation": "true",
            "Function_Name_Obfuscation": "true",
            "String_Obfuscation": "true",
            "Constant_Obfuscation": "true",
            "Call_Obfuscation": "true",
            "Advanced_Obfuscation": {
                "Code_Flattening": "true",
                "Proprietary_Logic_Insertion": "true",
                "Safeguard_Insertion": "true",
                "Dead_Code_Insertion": "true",
                "Code_Substitution": "true",
                "Dummy_Code_Insertion": "true",
                "Variable_Renaming": "true"
            },
            "Supremebfuscator": {
                "Opaque_Predicates": "true",
                "Encrypted_Strings": "true",
                "Control_Flow_Flattening": "true",
                "Parallel_Obfuscation": "true"
            }
        }
    }
}
char_map = {'0': 0, '1': 1, '2': 2, '3': 3, '4': 4, '5': 5, '6': 6, '7': 7, '8': 8, '9': 9, 'a': 10, 'b': 11, 'c': 12, 'd': 13, 'e': 14, 'f': 15, 'g': 16, 'h': 17, 'i': 18, 'j': 19, 'k': 20, 'l': 21, 'm': 22, 'n': 23, 'o': 24, 'p': 25, 'q': 26, 'r': 27, 's': 28, 't': 29, 'u': 30, 'v': 31, 'w': 32, 'x': 33, 'y': 34, 'z': 35, 'A': 36, 'B': 37, 'C': 38, 'D': 39, 'E': 40, 'F': 41, 'G': 42, 'H': 43, 'I': 44, 'J': 45, 'K': 46, 'L': 47, 'M': 48, 'N': 49, 'O': 50, 'P': 51, 'Q': 52, 'R': 53, 'S': 54, 'T': 55, 'U': 56, 'V': 57, 'W': 58, 'X': 59, 'Y': 60, 'Z': 61, '!': 62, '"': 63, '#': 64, '$': 65, '%': 66, '&': 67, "'": 68, '(': 69, ')': 70, '*': 71, '+': 72, ',': 73, '-': 74, '.': 75, '/': 76, ':': 77, ';': 78, '<': 79, '=': 80, '>': 81, '?': 82, '@': 83, '[': 84, '\\': 85, ']': 86, '^': 87, '_': 88, '`': 89, '{': 90, '|': 91, '}': 92, '~': 93, ' ': 94, '\t': 95, '\n': 96, '\r': 97, '\x0b': 98, '\x0c': 99}
strings_table = []

# if_you_put_a_buck_in_my_cup_i_will_suck_you_off = "Void Gen on top??!!?!?!?!?!?"
(76586 + 34947)
佥傞傀儸À儠儤儤兙僑仡俨y兦傀儯儹儖俣傢ô儫人ç児儳Aë儓Î儦傪僟傷E儰僭傃亻兛僒pÛ倌僿兂ô儌僭傖傯éyV兌Gnf倻俣傃儬僚價Q伢傫傛X傃倬儼Á兊kê傠僥ZàÆ伋優內Æ儜俉Èà儭è內LÓ亻傢僛儑B儣儳僀偕儛俣僖儂N丨儎儮é儢儥z儜傠人儛儗傯僶僾僭僒偃f僻償僪伢僷兌傢人僚ú倬儒兦L儚僓兀傼é儻Œ側傰Ô僅僚儐儯僄y傹Ë僠m傃儏僄僾兞Â僴Ü人傸僪儤gà伋儱僑F偵S儤佥偱僡ñ傀W儠儲fn僯â傰儹兏y僻Ùl兎JZê仫儮nb傞僥Mëí儗僾僅僨兠傖僭僂傈儠僿僲傫僨儰儢JŒ兌儿兀Ú亅儙僝僬D儯僄é儃TWçc儣傰兤亻傈I傭m儨儬T儬傳A兀傃儯僉児僻儶傽兤傕o兦ù兂億僮D偱僨兀兤僒偰t侔儔儵傽僼儛儘僾I儧儼兒偲僑傛E僡Ï傱aKée僐OÔ兗è儮F僽l仫僚仨丿儧傸傳t僤b僤傼俪僡儓僎儳儽僕僀f俣儏É俳儎僯儣Á兦兝È仨傳F僭x兦傫倬僂Ó儻V兝l兛傕ñ儕Ë兙僻âw儫w儍儁儼偁兀i兗cJ儽儡僮償ôç儁儑o儞Q仡僖僄児兛È傶wUç亅傱F儥兂乙僚儾側Ñ儑兎側Ü僛儂É傴Z僝儁p僫倬僄僘僓O傼兓儭價YB僟兘C兛儂仫儍亅傜偱ó偕儥傕r傢傛備兓儑ÜA偕g儕俳儱僎儲儓偃o僱âu僭優僚傡c儏Æ傽僾儤僕eûÙ僶僽儃C僩n傯儃僐C儓 = 1
(93263 + 33499)
# edit_kinda_stinks = "https://e-z.bio/hot"
for 僰儒偺傹儯側F偸儷î伢兗儈僫ï儣兊仌侑僖僗Àó亅ÙbRbÔ儧Qç儁債僖僬Z傔儖儊wï僨Ñ儖儾兀僀僩僥m僲儕ñV儅俪傸儅儩僄兤È傰僭儢僄f僱偁傰RÛ儤C僴僒儛È俣傠傶偕僭兡Ü兟兟VíÏ傾Â儽JH兟p儼êá儣僓e俪ú兣T僼x丿儩仨儂兛僷I傹丨傖傼ç兟傔Q僎儻儏僞兌傘兠ï傯p傛傞üi僑儊ú儴íVN傶儏à儮t僑僸僤r傴兡偃儅儚OÁ儎g傴I僨傸偰儝Œ児內兂À儞ù儷傰傛俨nœ儮僜僪Ù人D僖Ç傷儖i僒價Ab僠á僑僞佤WÍ偸兠僗é傠儰兞傹價ô儦億儗僉僲ñ俪儚Í人xa儾傜Ñ兠ÂÇ儚Y仡VH僝僔儐S仡oPÉ僕仨p僖儈áA人兀E儥儺儾傫Í儽儑傭兎僱é儕儈Á儎傭â儹儴F僘傾傜D僡僬î僡僠兠傜僰Æ儃儭兦優傷兩僮儍傯傘人儭v儕俣僴傼傃só傼僷僰I傪儒儚ñ人ù僀僔僨儺ÁÁÈ儥ó備兦z僥億儉儃ùh償僑儎Zœ僸傸倌Úé丿Â儩伢僱ôè倬人n儊儕乙僔儭佤êï儤僙À儭僙僠W儬Ù儞Ê傾佥P僖丿儤僒僘ù僸ç傀M僭僖偀傔Ë傃儳儯僒儚僾儢Â僛亅僊儒僐僇丿Ü俳僛僊ëy兤僣兤儮ÁÔoL偁僷傳È僜僤侑兎僲傔兦jó儖僕傪傠儂僂é僇â儁ú傢兎僩傛儊儦傕儖僙Â儡僱僗儴僚兤倬兦RÚ儉N兟兎儃儐兌儊倻Ê傞僔PÏ伢qÑ儀Ó儶傫僿h仌yú傀兂N傰傘儯儛 in range(7790):
    pass
儺伢d兟償兝lÚêN倬é儦T傫佥亅r傾儶g儶儣Ô傪傢亅丨Q兂rDÆ儤U傷仨僺U僱x偵儝兙儡儸傸僫僶俣僮傫傶仫侔兝儩僩兩J儼僡V亅H僝儃ÛÎ僷儚傾兞兟儾Àb傔傘lü僺僅ÿÉ人儖偀N僥X儔僇偃僫ÍNUG儩僕Íœü僕僠儣俣v兗t傱傼僷è儣兙hŸ儘兎d儕僞bw僮價j兓儐儧儈傜儺Ó兗丨M儜僖儽k傭僮傹儾R偂ü儊傯傰儜Í傰僜WS兀僯兂僯僢z伢儝儥兏oF侑儰sÓ偺SÚ儏儳V仡ñeç儝œ僕僂僉œ僞H傕lC僘伢Ñ兩Û倬Â儫v人儀k偱僨vG儵rfüf僊傯Mu儝N儉傃É儍r儝w僿i丿傶Ó儂儠僶兊儘佤À兒Â傰ÀoË俳FûU兏áŒ儗兊僶僮儝僊儍傖儢f備L兀僽倻儓兠t僿Üé傯僿儨儔儮Ïz傽ÏÍ儂儽儺KD側仫æ僠儻F偰儖儫儞傢僭儱t僛v儢儈儏儯儘傖傘儙æ傈儊儵ü側僓優傳僖QÆÀ儾傾儴Éé價傼O傞Ù儃僐e儑儝僂a僲傈儳儷FMÎ優VY儗僸儸üfÂ傠ó僨í僰傱儃Â亅僨僒儉G儊兙儹儻僎儜Yokë兦偺傠僂h債儰ûÔ儱僮乙丿儗僺傼儤偸僟偺價偂僺僟S僗僑儁僕僎僝Ÿ傛伋兤Úudüb僣倬儅俨e傛Ç僫傃偱儬TKL內兦儊偂ÿu兘óépññ傢兘q倌Zè偵僠伋儐R儺兀âŒ傕儜j儿Œ兟M兀u僫僓éïh僶僒佥仫Q僉僺僨or儈儃儐儱兟倻僔兓Ó儾僞 = 2
傈a偕偽x兂Xï傽儉僛儭僟儶儵偂丿伋児偕偵僮僭僣僛僄偂僟EE僺僟僗傡儥IQ僄偂僽Ó儓XŒ傴儢侑偲傖P亻H兂僊侔兝傶儀內儒俳Bm傭亅兗偃儴僜À仡僮儩佥WŸ偱僓僫兙儙j僨傯僭傹人儅儵偂r僥債僸僒傾儃仌MVlD僴偲nm內亻儤Üa兝僾傪偺儠傘偸儚儎儊è侔ô僡億儥â俉ñÿ傔e儚偕傫仫Ç兛偕傫傾É傫v僡í僗儕僊Ÿ儊兂兝ÉqÛ儅僛僅兠偱兊僎儈ËÉy傫俳僯兦俉僽p僑儳儲儢儩倌傹ê傢儳僼s俣僙傷儲兛僫wd儤O伋儯僅Dz兘傞僫偀傯儌儛侑n俉ê傳儥兀uÇ僀儱兗G兎ÎG僊儃伢僔Â傕僫Q儎人Ó儛佤億é儤Æ僑儠僢HcTmŸ債q僫傘偰R側儑僄儃Uè傔儌僽儫ç儏僭仌û兙傔á俪O僲儻億Û儿A傡僛僶僔僙俳Í兗Ù儞兌Hg優僘ñ倌僸傖傷債z傹儒M僇û億儂傜傯儔傪傀償兞兘儃兝儬僽I僬僬傰僖儠R僰ú儹傢儂兦儒D俳R偺O僲Á僅偃儏Í傖éPñ佤僡pS兂儓儿俣僖兗兙児ÉC儡Âc傔兞t儥僊儨儅兣僂兤儱儈傽兞僸Ê偱në僮佤儊傰儙儡J僄c儹亅儨僉ú傪儭傛GÑS傫亅僨兞僀亅傜儴ÿ僫S儫僿nh傠兤偁僠i儯P儲D優兓傭儐H儥Ó僑儧傡僒僿僻僟偂儫偸傫Í僞Â兠丿é兏僱僅儑儔傜僼儛儁傭傫儓兊儢兎YûÀú儒內傜œE傢儤t儸儱Ô僩兣B僇傰M傹偸l僇m兝Oc = 3
僶A傢e侔w儰b兗儉俨兌俪ç僪兞傪Ë侔儵儧兏侔j兊儌仫Z儻儖偰僤傷儏僤a儔tÎG儾傳儰僒儫儸ÆJ僙側儫êHg傠JàÉ儮僩偺偱傰僓丨p僜M俉v僩O僒j傰C兙僥q儸傪僪xE伢兂傶k儣偁偵C傫倌t儙伋k僽OE儀q傫儣儤儡僭兠œ僨亻儁偀儿僤Í儳z傀儾丨儮Æ儡儌fá兦兛兗偽儩Ê儵兏Z児G內僥僪傶傃儶Á傘儲兀傳傷丿á僀gg僇傡儒o僷僐俉儲僮俉偰伋m伢傴僠僙仌Rn儌lË僘u傔b兂Ÿ仌儅儷傀僓Ñ儙儣兓Áé傠丿aÂ侔傸僰ü傢傈偽僢儣儰Æ僸僮僻M儔儛My儼cœ兂f兏僽s儛僟侔儹É兟áÁy僖僺e儺仨é傃s僴儺兘mX價É倬儮側僽兌Êœ億傶僬傼儨丨yÈ儘I儠é丿儸儤兓儬p偺ËP儖丨僾兒儉偲í儊傀僪僣丨è僸儭a佤aO儔儴僓儁債ÛT偰Gé偕傘儏兀j兤œ儚儕Í仨p丨X儭儁偱僺ê傛Ÿ儌儕偽傴儳儗儒êÛs偂偕仡儞僤僝僿儠偸儔丿債僞僷儙兛僔亅儴僅儔伋ñ傪傫AVËCgké僱侔僴D僚儣Ë僞兌僖儣僚儸伢ê傾Ü傽儂僝QkWùP僬兡I僟Œ傃a僻僽僂傹儰價儀儕儚兎Ô僎T儩Ç儰x傜dJU兀佤J兒úœ兓儌V僶F儾僟僮僓傰傷ŒJá僱僅僊bi儸儳乙儙Â側儍儮儾ó儲傕儚Ok偂é儺Ÿ儉傡兡僛亻僖倌e儒價儑ñptD丨兓儏僲僐僘僗QÛ儬儏傳丨í僜æM = 13162
兟僐偸Aéï僂儔mI偽偺人儌人Ó僮儩儭傹儹B儏儭兓僓U兓g偸æ兣Ú偱兦儘僡wÙ仨仨僚儌僲e僶僻儤傃儑R児俨Aî僜俨儍僤O傪Ù偲E僂儷僞兙儙BOû儌傸儍F儗僐兙偵僙儏儛H儓n內儓Ni僘児僐C儦儘儂僢傫ñ僒儈c儡偁僟g僲儝兌僥c僟債Ñ兙t僶俨ñ儳僎偵僮仨偕D優倬儻儑僘丨僣儂H僽傾兞仨俳儠僝ô亅備Ï傰佥儈儴傹伋偺儧傘œ僬侔傖á伢V倻僱傠儀ñ儷倻k僶傈î偸GR儥Âxî兟兣Ç僣ŸîÁŒ傱傹僴V儤Ù儔價fs僼僔伋ÿÎ儒儹儈儺k亅Lsæ亅ŒÁn偕儦僸傜ÂB兙仡傠é儭傷É傫Y儲oCC偸Lq僣儘v儳儌僔Ûkç俉ÔÔ乙偽俨ÔÛñn偃偱儰僷僙儰JJ僜Çqó僎傔僀兞Â僄僻儿傃æa儰僷兏儅僪儻兝侑僭傡兞儬x傠偰Æé儵倬儛僘僚僱儸價f傴Î兒偸儫仫兟àFù兠p傫兞俣Ñs儙人É僔僡儢僤亻儧Ç儰債X儥H児儌僊僮仡Q儜亅儯僠儉儍Y兤傀兙備傳Œ兌A亻E偺zÙ兊伋俪兛偰傷伋À倌ÛB傢Í儷僙儦僘傀僺傔兌z僕V傘ÿ伢儽X兤仫Œ伋儵偽ÀSÉ儡儻僺Ë兣侑僬侔儻ëÊ仨üÊ儁儲f僒E僕偂兂i儺僝w俨仨Ó儢兞傸僗R儱丨ç傕w僲僣ô傛UÁ側È僸Ÿ內v兩Ê傽兤偀僉倻傠儚僬Œ兣á儜僝倬儔人傘儻僘儈傯É儾yÈg僉儽傰儊ù僰儩儵L僒兏儾儐儍伢佥僶儷 = 96183
# if_you_put_a_buck_in_my_cup_i_will_suck_you_off = "This code was obfuscated by User319183's Python Obfuscator"
for 兞兒儮儛p仡K偀儈傼僖僀q僟俪儫僺僜ôêa儑人傷價僠È傯儧w丨兟兀僔x僷偁儲儿僻儕儐Eo僲侔兀俳Ç儊僚仌ÓÜ僓亅儚Ó傯Â丿儉Ï傀儸rû僂ê僣僬兝È僅兣僜價Vf僪兠儖僞僤ès兊傞偃儲儳儉價儺C僥傪偕僚偁儴僐兗儃Ê偂C兣丨DVà儗Új傢兀c兝儔偰僲I僮A傠傭償優儓儁傰Ó僭y俪儫Â僑乙児G債q僨E儖傫僖僻儮侔傾僘傢優倌僗僺i僐傘儧僩儴g傖傫É儚僖僞Na偂儣佥儗傖僮K儢仡儐偲兎傭偲C儗僶ÀK僇僚僡w儞佥儹傈w僑兏僫k儅僊u儍I丿傀僸內傔傞仫儣儐偁兘I儞ëG兠俉兎à僫ïÂ仡僗僔w兊僕Í儏儲ANÿ儹Ow傠Á僉XkV儶ù兏僼儮儾傘B傀Re僊僱償傡偁亅儘傾儧lrx儥傀兞ñ僠兞Î兠C仫儹ë僼傭僮丨偱â傭兩僼G優僓佥d偀億僠儚倻僒ü儐儨æ侑ê兞Ë兗仫僓僓僘僨m兘儩ÙVUy儲ô兩CR儘p俨傷僲仡傕HT児傞僛œbC僚儌僱Ó儙傶兗乙à偸ê僒僶僒僯傴傔儮僚人Á儳僀僢a儾î儮儭儼佤ú儀價俪僚仌儅僡傢僩儡儓Ï兀儺儣僱兟債偸儐儵儙偕ë傽z儝児児伢傪傢儂éN傜Ê儃儊儁儫k兦儜僊偵偃Ô儭F僐傡儾僎W侑N僞倌É內儃乙兙丨兟侑a僅n僨ó僱僒傱Ï傃BÍ儜儑R儛v傳儶傸儯X傖傈m儸Ñ傠è丨I兤儤偺傀j侑僾僤僭Îô佤傃偸儮儵俨Á僺兒 in range(0, 10):
# king_jun_umu = "Another day, another victory for the OGs"
    print(兞兒儮儛p仡K偀儈傼僖僀q僟俪儫僺僜ôêa儑人傷價僠È傯儧w丨兟兀僔x僷偁儲儿僻儕儐Eo僲侔兀俳Ç儊僚仌ÓÜ僓亅儚Ó傯Â丿儉Ï傀儸rû僂ê僣僬兝È僅兣僜價Vf僪兠儖僞僤ès兊傞偃儲儳儉價儺C僥傪偕僚偁儴僐兗儃Ê偂C兣丨DVà儗Új傢兀c兝儔偰僲I僮A傠傭償優儓儁傰Ó僭y俪儫Â僑乙児G債q僨E儖傫僖僻儮侔傾僘傢優倌僗僺i僐傘儧僩儴g傖傫É儚僖僞Na偂儣佥儗傖僮K儢仡儐偲兎傭偲C儗僶ÀK僇僚僡w儞佥儹傈w僑兏僫k儅僊u儍I丿傀僸內傔傞仫儣儐偁兘I儞ëG兠俉兎à僫ïÂ仡僗僔w兊僕Í儏儲ANÿ儹Ow傠Á僉XkV儶ù兏僼儮儾傘B傀Re僊僱償傡偁亅儘傾儧lrx儥傀兞ñ僠兞Î兠C仫儹ë僼傭僮丨偱â傭兩僼G優僓佥d偀億僠儚倻僒ü儐儨æ侑ê兞Ë兗仫僓僓僘僨m兘儩ÙVUy儲ô兩CR儘p俨傷僲仡傕HT児傞僛œbC僚儌僱Ó儙傶兗乙à偸ê僒僶僒僯傴傔儮僚人Á儳僀僢a儾î儮儭儼佤ú儀價俪僚仌儅僡傢僩儡儓Ï兀儺儣僱兟債偸儐儵儙偕ë傽z儝児児伢傪傢儂éN傜Ê儃儊儁儫k兦儜僊偵偃Ô儭F僐傡儾僎W侑N僞倌É內儃乙兙丨兟侑a僅n僨ó僱僒傱Ï傃BÍ儜儑R儛v傳儶傸儯X傖傈m儸Ñ傠è丨I兤儤偺傀j侑僾僤僭Îô佤傃偸儮儵俨Á僺兒)
# if_you_put_a_buck_in_my_cup_i_will_suck_you_off = "sacrifice loves skidding"
    print(佥傞傀儸À儠儤儤兙僑仡俨y兦傀儯儹儖俣傢ô儫人ç児儳Aë儓Î儦傪僟傷E儰僭傃亻兛僒pÛ倌僿兂ô儌僭傖傯éyV兌Gnf倻俣傃儬僚價Q伢傫傛X傃倬儼Á兊kê傠僥ZàÆ伋優內Æ儜俉Èà儭è內LÓ亻傢僛儑B儣儳僀偕儛俣僖儂N丨儎儮é儢儥z儜傠人儛儗傯僶僾僭僒偃f僻償僪伢僷兌傢人僚ú倬儒兦L儚僓兀傼é儻Œ側傰Ô僅僚儐儯僄y傹Ë僠m傃儏僄僾兞Â僴Ü人傸僪儤gà伋儱僑F偵S儤佥偱僡ñ傀W儠儲fn僯â傰儹兏y僻Ùl兎JZê仫儮nb傞僥Mëí儗僾僅僨兠傖僭僂傈儠僿僲傫僨儰儢JŒ兌儿兀Ú亅儙僝僬D儯僄é儃TWçc儣傰兤亻傈I傭m儨儬T儬傳A兀傃儯僉児僻儶傽兤傕o兦ù兂億僮D偱僨兀兤僒偰t侔儔儵傽僼儛儘僾I儧儼兒偲僑傛E僡Ï傱aKée僐OÔ兗è儮F僽l仫僚仨丿儧傸傳t僤b僤傼俪僡儓僎儳儽僕僀f俣儏É俳儎僯儣Á兦兝È仨傳F僭x兦傫倬僂Ó儻V兝l兛傕ñ儕Ë兙僻âw儫w儍儁儼偁兀i兗cJ儽儡僮償ôç儁儑o儞Q仡僖僄児兛È傶wUç亅傱F儥兂乙僚儾側Ñ儑兎側Ü僛儂É傴Z僝儁p僫倬僄僘僓O傼兓儭價YB僟兘C兛儂仫儍亅傜偱ó偕儥傕r傢傛備兓儑ÜA偕g儕俳儱僎儲儓偃o僱âu僭優僚傡c儏Æ傽僾儤僕eûÙ僶僽儃C僩n傯儃僐C儓)
# school_is_for_losers = "User319183 was here!"
# edit_kinda_stinks = "This code was obfuscated by User319183's Python Obfuscator. Join the Discord if your a kool kid: https://discord.gg/KHJjX3y2B4"
    print(儺伢d兟償兝lÚêN倬é儦T傫佥亅r傾儶g儶儣Ô傪傢亅丨Q兂rDÆ儤U傷仨僺U僱x偵儝兙儡儸傸僫僶俣僮傫傶仫侔兝儩僩兩J儼僡V亅H僝儃ÛÎ僷儚傾兞兟儾Àb傔傘lü僺僅ÿÉ人儖偀N僥X儔僇偃僫ÍNUG儩僕Íœü僕僠儣俣v兗t傱傼僷è儣兙hŸ儘兎d儕僞bw僮價j兓儐儧儈傜儺Ó兗丨M儜僖儽k傭僮傹儾R偂ü儊傯傰儜Í傰僜WS兀僯兂僯僢z伢儝儥兏oF侑儰sÓ偺SÚ儏儳V仡ñeç儝œ僕僂僉œ僞H傕lC僘伢Ñ兩Û倬Â儫v人儀k偱僨vG儵rfüf僊傯Mu儝N儉傃É儍r儝w僿i丿傶Ó儂儠僶兊儘佤À兒Â傰ÀoË俳FûU兏áŒ儗兊僶僮儝僊儍傖儢f備L兀僽倻儓兠t僿Üé傯僿儨儔儮Ïz傽ÏÍ儂儽儺KD側仫æ僠儻F偰儖儫儞傢僭儱t僛v儢儈儏儯儘傖傘儙æ傈儊儵ü側僓優傳僖QÆÀ儾傾儴Éé價傼O傞Ù儃僐e儑儝僂a僲傈儳儷FMÎ優VY儗僸儸üfÂ傠ó僨í僰傱儃Â亅僨僒儉G儊兙儹儻僎儜Yokë兦偺傠僂h債儰ûÔ儱僮乙丿儗僺傼儤偸僟偺價偂僺僟S僗僑儁僕僎僝Ÿ傛伋兤Úudüb僣倬儅俨e傛Ç僫傃偱儬TKL內兦儊偂ÿu兘óépññ傢兘q倌Zè偵僠伋儐R儺兀âŒ傕儜j儿Œ兟M兀u僫僓éïh僶僒佥仫Q僉僺僨or儈儃儐儱兟倻僔兓Ó儾僞)
    print(傈a偕偽x兂Xï傽儉僛儭僟儶儵偂丿伋児偕偵僮僭僣僛僄偂僟EE僺僟僗傡儥IQ僄偂僽Ó儓XŒ傴儢侑偲傖P亻H兂僊侔兝傶儀內儒俳Bm傭亅兗偃儴僜À仡僮儩佥WŸ偱僓僫兙儙j僨傯僭傹人儅儵偂r僥債僸僒傾儃仌MVlD僴偲nm內亻儤Üa兝僾傪偺儠傘偸儚儎儊è侔ô僡億儥â俉ñÿ傔e儚偕傫仫Ç兛偕傫傾É傫v僡í僗儕僊Ÿ儊兂兝ÉqÛ儅僛僅兠偱兊僎儈ËÉy傫俳僯兦俉僽p僑儳儲儢儩倌傹ê傢儳僼s俣僙傷儲兛僫wd儤O伋儯僅Dz兘傞僫偀傯儌儛侑n俉ê傳儥兀uÇ僀儱兗G兎ÎG僊儃伢僔Â傕僫Q儎人Ó儛佤億é儤Æ僑儠僢HcTmŸ債q僫傘偰R側儑僄儃Uè傔儌僽儫ç儏僭仌û兙傔á俪O僲儻億Û儿A傡僛僶僔僙俳Í兗Ù儞兌Hg優僘ñ倌僸傖傷債z傹儒M僇û億儂傜傯儔傪傀償兞兘儃兝儬僽I僬僬傰僖儠R僰ú儹傢儂兦儒D俳R偺O僲Á僅偃儏Í傖éPñ佤僡pS兂儓儿俣僖兗兙児ÉC儡Âc傔兞t儥僊儨儅兣僂兤儱儈傽兞僸Ê偱në僮佤儊傰儙儡J僄c儹亅儨僉ú傪儭傛GÑS傫亅僨兞僀亅傜儴ÿ僫S儫僿nh傠兤偁僠i儯P儲D優兓傭儐H儥Ó僑儧傡僒僿僻僟偂儫偸傫Í僞Â兠丿é兏僱僅儑儔傜僼儛儁傭傫儓兊儢兎YûÀú儒內傜œE傢儤t儸儱Ô僩兣B僇傰M傹偸l僇m兝Oc)
    print('we love fruit')
JÙPÎEÙ儿儖ó僒僖儺傜侔債僣儿倻T俣êPÇ傭ó俣倬儒儹僉僔兟兂Æ僽儒僯儦僸儦儾Ë僄儫僥M傷Qû偕k儜傀儎傠C傳J儯偰傈ÊñŒçE內僯j偵僐僖儵內兙儝儛僗é傱dIy傛儙儈儔偸v僐僸僝僾傸l傕儤僒億仨儳儈儓ù儅僒偁傶兂俪Ü傘á佥儸ó僠俣僪儘偰儫俳兙倌僐儓傭f僽儷儬ù儳L倬ú儌ç儤O傳儌兌償傃傠E僷ó僭僨僤G儮m傹儃佤傈僽侑儖傽儅儔i偸侑倌僅ë兘ô儿L兗僚儙僥偺僰Nj僸僓兀傱k兡HÜ僢兂兤仌僱儩儬佥ÀHXÇx儌儮僞儍Ÿ傽僷兙優僷儖仫傖儣傡兝倻ÁN僥儯傈Úà僿ÿ僶僞H僷兤éû傘乙儾俣儽儺í儐儴儕兙丿僐Ê儾c僭儉僘傳僒儭儖傫Dy兀l偰儫傈傔f兦僿偃zI僂儫傰俪傢兓僷傾儩兦倌傹僯dls俉債儸儔Ë僎n兞儒ïeJBcoÉÛ傜Ù僊僿傰eü儌儰儼僶Î僰Í亻價仫儒Ÿçp兝儴兞僜C儡傳僻偕側儘僼儅儭俨儡V僫僮Á儊僿儼â儽僂仨儖ÜSŸQHâmæ倬cO傠USœ僸儅儒偰F僕偲僢儢hê僬僴v丨îË儵僛側傕儭債lE儳儵ó僙俣傴a僺偸僀備僅儬儗傢僥僔傡儽Ù儴儭僀僻兩ë僩Ç儘U傾傫Çà儶H俉儥éG儌k僺偕僽儂s儓儜儦儥Í儧僖ÎNV內備兒偺傛僕兝傠儳僛僝Í儙僽債K兞仫vS偃偰儊w僽人児僨Lt儼僻儺亅儭僉î傼債ézÏ俉亅儡 = 58932
for 僰儒偺傹儯側F偸儷î伢兗儈僫ï儣兊仌侑僖僗Àó亅ÙbRbÔ儧Qç儁債僖僬Z傔儖儊wï僨Ñ儖儾兀僀僩僥m僲儕ñV儅俪傸儅儩僄兤È傰僭儢僄f僱偁傰RÛ儤C僴僒儛È俣傠傶偕僭兡Ü兟兟VíÏ傾Â儽JH兟p儼êá儣僓e俪ú兣T僼x丿儩仨儂兛僷I傹丨傖傼ç兟傔Q僎儻儏僞兌傘兠ï傯p傛傞üi僑儊ú儴íVN傶儏à儮t僑僸僤r傴兡偃儅儚OÁ儎g傴I僨傸偰儝Œ児內兂À儞ù儷傰傛俨nœ儮僜僪Ù人D僖Ç傷儖i僒價Ab僠á僑僞佤WÍ偸兠僗é傠儰兞傹價ô儦億儗僉僲ñ俪儚Í人xa儾傜Ñ兠ÂÇ儚Y仡VH僝僔儐S仡oPÉ僕仨p僖儈áA人兀E儥儺儾傫Í儽儑傭兎僱é儕儈Á儎傭â儹儴F僘傾傜D僡僬î僡僠兠傜僰Æ儃儭兦優傷兩僮儍傯傘人儭v儕俣僴傼傃só傼僷僰I傪儒儚ñ人ù僀僔僨儺ÁÁÈ儥ó備兦z僥億儉儃ùh償僑儎Zœ僸傸倌Úé丿Â儩伢僱ôè倬人n儊儕乙僔儭佤êï儤僙À儭僙僠W儬Ù儞Ê傾佥P僖丿儤僒僘ù僸ç傀M僭僖偀傔Ë傃儳儯僒儚僾儢Â僛亅僊儒僐僇丿Ü俳僛僊ëy兤僣兤儮ÁÔoL偁僷傳È僜僤侑兎僲傔兦jó儖僕傪傠儂僂é僇â儁ú傢兎僩傛儊儦傕儖僙Â儡僱僗儴僚兤倬兦RÚ儉N兟兎儃儐兌儊倻Ê傞僔PÏ伢qÑ儀Ó儶傫僿h仌yú傀兂N傰傘儯儛 in range(3555):
    pass
(21725 + 18578)
(43766 + 1369)
儕僲傽Ú佥兗僊OX儜QM儲d儈兩儿傹É傯僄Úæ傖儿仫Æ儽C儓儹U僱W儔傴儠í儠Ê儈儾儶僔Û僄儌人僼傷ñ僒U僂儏F僰n傶仌亻倬児儰儼兟伋儬僡俳兀兀傪儲僊ZD儞儐僱儧側儸儏儫兌傱側É兀Â兡傜兒Ï僑僘傠兏兏價EIr僤側偀YW儊兦僎儊儏儈傭儤儀仡僨僣僲儵兀âY僼僣儦僂偂ñ僇jíQ傀僙儭ë儰n傭儹僻兤倌佥儩偸僝亅側乙伢儶b儙僺儹兠兏儞é儀儔儡bfY偺僽t儤傼兡Ù僡偽îA僖僚侔NVy兘僪儐q俣児儲ñ儏傞兏僄傛m僇NÇ儅優傛僟儐傳偽傶儼zS偲Çt儼兞児僐兝ÂÆù儉儖儙僤儢ñ僭內兤PÚp傹僀傶Í儠僴乙ÿL儌僤僩儍僔ÿ俳僸cÉ僫È僉仨儮â儤á偺僽傞側F倬tY兒t傛傠儽ï兊é儀僖儉儭nU僚Ó儫仡僂兠儂儣傭儜ÜŒ倬I兘僻傖Æ僯佤J僕Cë儎oxc僟偰g偂傔傹僨僽傕仌儼Ÿ兙亅僭儸儾Ê傞僓儜儵儲僗亻兟伋偂儐儿僴僿T児M億èbÇX傪偺僿僭偺儍側儍億傶I僨g儓傴B伢兟O僾僤伋傼íCA俉兘倬僴儵s儀僚C儵傸儚儝ŸO傯y儃僿仨Ë儙ÙR兡儦儭丨僎é仌N傳儳伢ë傢à儶傾儠á優僗p億伋ù俣兘傃儱儓儳儯Ú僮傶Ê僡侔傾ÏñVs兊僻僿儍É僘xÍ儐僑S兝É僫僺兒ë傃傪Ç儼僢儈儴兦r儳儫儌僰優Ô儱僣僺偁Ü儻傘亻乙兂儎僊儚wÉ僔俨儡L儖儩 = 5654
